//----------------------------------------------------------------------------------------------------;
+  - addition	숫자 표현식을 추가합니다.

-- - decrement	피연산자에서 1을 뺍니다.

/  - division	expression1을 expression2로 나눕니다.

++ - increment	표현식에 1을 더합니다.

%  - modulo	expression1을 expression2로 나눈 나머지를 계산합니다.

*  - multiplication	두 개의 숫자 표현식을 곱합니다.

-  - subtraction	부정하거나 빼는 데 사용됩니다.
//----------------------------------------------------------------------------------------------------;

a + b;

--i;
i--;

a / b;

++i;
i++;

a % b;

a * b;

a - b;

//----------------------------------------------------------------------------------------------------;