//----------------------------------------------------------------------------------------------------;

//	Object를 Parameter로 받는 함수;

//----------------------------------------------------------------------------------------------------;

/**
 * @function
 * @param {Object} d data
 * <code>
 * {
 *	"a" : 1//숫자 1이다;
 *	, "b" : 2//숫자 2이다;
 * }
 * </code>
 *
 * @return
 * <code>
 * {
 *	"a" : 1//숫자 1이다;
 *	, "b" : 2//숫자 2이다;
 * }
 * </code>
 */
var asd = function( d ){ return d; };

//----------------------------------------------------------------------------------------------------;

//	기본 자료타입들을 Parameter로 받는 함수;

//----------------------------------------------------------------------------------------------------;

/**
 * @function
 * @param {Array} a//담겨있는 객체의 설명;
 * @param {Boolean} b
 * @param {Function} f
 * @param {Number} n
 * @param {Object} o
 * <code>
 * {
 *	"a" : 1//숫자 1이다;
 *	, "b" : 2//숫자 2이다;
 * }
 * </code>
 * @param {String} s
 */
var asd = function( a, b, f, n, o, s ){};