//----------------------------------------------------------------------------------------------------;
... (rest) parameter - 함수가 쉼표로 구분된 인수를 무제한으로 받도록 지정합니다.

class - 사용자가 정의한 메서드와 속성을 공유하는 객체를 인스턴스화하는 데 사용할 수 있는 클래스를 정의합니다.

const - 값을 한 번만 대입할 수 있는 변수인 상수를 지정합니다.

function - 특정 작업을 수행하기 위해 정의하는 일련의 명령문을 구성합니다.

get - 속성처럼 읽을 수 있는 메서드인 getter를 정의합니다.

set - 공용 인터페이스에 속성으로 표시되는 메서드인 setter를 정의합니다.

var - 변수를 지정합니다.
//----------------------------------------------------------------------------------------------------;