//----------------------------------------------------------------------------------------------------;
dynamic - 클래스의 인스턴스가 런타임에 추가되는 동적 속성을 가질 수 있도록 지정합니다.

final - 메서드 재정의 또는 클래스 확장을 수행할 수 없도록 지정합니다.

internal - 클래스, 변수, 상수 또는 함수를 동일한 패키지 내의 모든 호출자에서 사용할 수 있도록 지정합니다.

override - 메서드가 상속된 메서드를 대체하도록 지정합니다.

private - 변수, 상수, 메서드 또는 네임스페이스를 정의하는 클래스에서만 변수, 상수, 메서드 또는 네임스페이스를 사용할 수 있도록 지정합니다.

protected - 변수, 상수, 메서드 또는 네임스페이스를 정의하는 클래스 또는 해당 클래스의 하위 클래스에서만 변수, 상수, 메서드 또는 네임스페이스를 사용할 수 있도록 지정합니다.

public - 모든 호출자가 클래스, 변수, 상수 또는 메서드를 사용할 수 있도록 지정합니다.

static - 변수, 상수 또는 메서드가 클래스의 인스턴스가 아니라 클래스에 속한 것으로 지정합니다.
//----------------------------------------------------------------------------------------------------;