//----------------------------------------------------------------------------------------------------;
... (rest) parameter - 함수가 쉼표로 구분된 인수를 무제한으로 받도록 지정합니다.
class - 사용자가 정의한 메서드와 속성을 공유하는 객체를 인스턴스화하는 데 사용할 수 있는 클래스를 정의합니다.
const - 값을 한 번만 대입할 수 있는 변수인 상수를 지정합니다.
extends - 다른 클래스의 하위 클래스인 클래스를 정의합니다.
function - 특정 작업을 수행하기 위해 정의하는 일련의 명령문을 구성합니다.
get - 속성처럼 읽을 수 있는 메서드인 getter를 정의합니다.
implements - 클래스가 하나 이상의 인터페이스를 구현하도록 지정합니다.
interface - 인터페이스를 정의합니다.
namespace - 정의의 가시성을 제어할 수 있습니다.
package - 다른 스크립트에서 가져올 수 있도록 코드를 여러 그룹으로 분할해서 구성할 수 있습니다.
set - 공용 인터페이스에 속성으로 표시되는 메서드인 setter를 정의합니다.
var - 변수를 지정합니다.
//----------------------------------------------------------------------------------------------------;